Revit 2027 API
ParameterTypeId.IfcExportPredefinedtype Property
 "IFC Predefined Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId IfcExportPredefinedtype { get; }
Public Shared ReadOnly Property IfcExportPredefinedtype As ForgeTypeId
	Get
public:
static property ForgeTypeId^ IfcExportPredefinedtype {
	ForgeTypeId^ get ();
}
static member IfcExportPredefinedtype : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace